In [1]:
import pandas as pd
import numpy as np
from ortools.sat.python import cp_model
from datetime import datetime, timedelta

In [2]:
import sys
sys.path.append('/home/cayena/Projeto_thefamily/TeacherScheduler/')

In [3]:
from streamlit_app.utils import transform_classes_dateframe,transform_teacher_dataframe,transform_alocation_dataframe,base_selection,expand_rows,replicate_row,clean_data
from streamlit_app.teacher_alocation import TeacherScheduler
from streamlit_app.validador import validador

In [4]:
aulas_raw = pd.read_excel('/home/cayena/Downloads/rotas_ultimo_professor2.xlsx')
professores_raw = pd.read_excel('/home/cayena/Downloads/professores_final(4).xlsx')

In [5]:
df_result =transform_classes_dateframe(aulas_raw)
df_professor = transform_teacher_dataframe(professores_raw)

In [6]:
Ts = TeacherScheduler(df_result, professores_raw)
base_alocada = Ts.schedule_teachers()
base_alocada

63626

    professores_alocados               nome grupo
0                RODRIGO       ABU DHABI EAD - 4X
1                  BELLA    ANDERSON VIP EAD - 1X
2                  BELLA  ANDRE VIP CONV EAD - 2X
3                  CAROL          AUCKLAND P - 4X
4                  CAROL       BAKERSFIELD P - 4X
..                   ...                      ...
145               SAMARA          NEBRASKA P - 3X
146                MARIA       NORTHAMPTOM P - 3X
147              NATACHA        SAN JUAN EAD - 3X
148               CARLOS           SCOTT EAD - 3X
149          MARIA CLARA       SOUTHAMPTON P - 3X

[150 rows x 2 columns]

In [7]:
df_final,aulas_nao_alocadas = transform_alocation_dataframe(aulas_raw,base_alocada)
aulas_nao_alocadas

Empty DataFrame
Columns: [nome grupo, horario, unidade, dias da semana, stage, livro, modalidade, grupo, n aulas, parag atual grupo, parag_final_grupo, teacher, status, zoom, n_alunos, rescisao, permuta, bolsista, n_total_alunos, stage_formula, parag_final_formula, num_1_sempre, ultimo_professor, penultimo_professor, restricoes_professor]
Index: []

[0 rows x 25 columns]